In [1]:
%load_ext sql

In [3]:
import boto3
client = boto3.client('ssm')
user=client.get_parameter(Name='redshift_user').get('Parameter')
password=client.get_parameter(Name='redshift_password').get('Parameter')
host='examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com'
port=5439

In [4]:
import os
os.environ['DATABASE_URL']='postgresql://{user}:{password}@{host}:{port}/dev'.format(**{
    'user':user['Value'],
    'password':password['Value'],
    'host':host,
    'port':port
})

In [5]:
%%sql
Create Table StudentInfo_1
(
StudentName Varchar(30),
Subjects Varchar(30),
Marks Bigint
)

Done.

[]

In [6]:
%%sql
insert into StudentInfo_1 Values ('David', 'English', 85);
insert into StudentInfo_1 Values ('David', 'Maths', 90);
insert into StudentInfo_1 Values ('David', 'Science', 88);
insert into StudentInfo_1 Values ('John', 'English', 75);
insert into StudentInfo_1 Values ('John', 'Maths', 85);
insert into StudentInfo_1 Values ('John', 'Science', 80);
insert into StudentInfo_1 Values ('Tom', 'English', 83);
insert into StudentInfo_1 Values ('Tom', 'Maths', 80);
insert into StudentInfo_1 Values ('Tom', 'Science', 92);

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%sql select * from studentinfo_1

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
9 rows affected.

[('David', 'English', 85),
 ('David', 'Maths', 90),
 ('David', 'Science', 88),
 ('John', 'English', 75),
 ('John', 'Maths', 85),
 ('John', 'Science', 80),
 ('Tom', 'English', 83),
 ('Tom', 'Maths', 80),
 ('Tom', 'Science', 92)]

Query to PIVOT row values to columns subject wise

In [12]:
%%sql 
select studentname,max(English) english,max(maths) maths,max(Science) science
from (
select studentname,
case when subjects='English' then marks end English,
case when subjects='Maths' then marks end Maths,
case when subjects='Science' then marks end Science
from studentinfo_1) baseT
group by studentname

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
3 rows affected.

[('David', 85, 90, 88), ('John', 75, 85, 80), ('Tom', 83, 80, 92)]